13/data/attachments/2d58db90b5afa839.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_817dc7dd-d2fb-4e9b-a521-147a13879097</nif:username>
            <nif:friendToBeAdded>Rachel_human_Actions_84731_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>